SOMA-do-secure-backup.xml

<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/">
    <env:Body>
        <dp:request xmlns:dp="http://www.datapower.com/schemas/management"  domain="default">
            <dp:do-action>
                <SecureBackup>
                    <cert>MyCert</cert>
                    <destination>ftp://ftpuser:passw0rd@ipaddress:port/BackupDir</destination>
                    <include-iscsi>on</include-iscsi>
                    <include-raid>on</include-raid>
                </SecureBackup>
            </dp:do-action>
        </dp:request>
    </env:Body>
</env:Envelope>
